#include <iostream>
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <cassert>

using namespace std;

class Valtan:public Gundanjang{
    public:
    Valtan(int gate){
        switch(gate){
            case 1:
                named = "검은 산의 포식자";
                battle_item[] = {"회오리 수류탄", "만능 물약", "성스러운 부적"};
                pattern[] = {
                "[시작]",
                "- 첫 조우 시 딜 몰기",
                "[45줄 | 보스 분열]",
                "- 중앙에서 보스 분열 (9시 대기) -> 루가루 등장", 
                "[40줄 | 루카스 난입]",
                "- 머리 위 표적이 있는 사람은 (어글자) 각각 12시/6시 유인 후 처리",
                "- 버프창의 금색 구슬 버프가 있을 시, 난입 대상 공격", 
                "[34~30줄 | 암흑 / 감금 패턴",
                "- 어글자 바뀔 때 마다 암흑 디버프 +1",
                "5스택 시 감금 -> 해당 패턴 때 딜 부족시 잡기 패턴",
                "[30줄 | 전멸기 : 결속의 구슬]",
                "- 중앙 보스 기준 1시, 2시, 4시, 5시, 7시, 8시, 10시, 11시 위치",
                "- 입장 전 사전 조율한 자리에서 구슬을 순서대로 먹고 무력화",
                "- 패턴 종료 후 보스 전환, 루가루 -> 루카스",
                "[25줄 | 루가루 난입]",
                "- 40줄 패턴과 동일",
                "- 머리 위 표적이 있는 사람은 (어글자) 각각 12시/6시 유인 후 처리",
                "- 버프창의 금색 구슬 버프가 있을 시, 난입 대상 공격", 
                "[15줄 | 전멸기 : 결속의 구슬]",
                "- 중앙 보스 기준 1시, 2시, 4시, 5시, 7시, 8시, 10시, 11시 위치",
                "- 입장 전 사전 조율한 자리에서 구슬을 순서대로 먹고 무력화",
                "- 전멸기 무력화 이후 외곽부터 터지는 장판 3번",
                "- 8갈래 폭발 후 보스 합체 -> 검은 산의 포식자",
                "[15줄 이후 | 공포 무력화 패턴]",
                "- 보스가 검은 안개를 터뜨리고 사라짐",
                "- 보스로부터 가장 먼 사람이 공포에 걸림",
                "- 걸린 사람은 핑을 찍어서 파티원에게 위치를 알림"
                "- 해당 위치로 가서 등장한 보스를 무력화"
                };
                esther[] = {"결속의 구슬 패턴 웨이", "실리안"};

               caution[] = {
                "[루가루 | 출혈 스택]",
                "- 피격시 출혈 스택 +1",
                "- 3스택 중첩 시 대상자 기준 일직선 강력한 범위 공격",
                "- 정화 룬, 정화 스킬, 만능 물약 등 사용",
                "[결속의 구슬]",
                "- 몇 번째 구슬까지 먹었는지 확인이 힘든 경우 보스 체력게이지 바 밑의 디버프 개수를 확인 (공대원들이 먹은 구슬 개수만큼 표시)",
                "- 보스 체력게이지 바 밑의 버프에는 이전 사람이 먹은 구슬 색상 확인 가능"
                };
                break;

            case 2:
                named = "마수군단장 발탄";
                battle_item[] = {"부식1 파괴7", "시간 정지 물약"};
                pattern[] = {
                "[시작 | 갑옷 파괴]",
                "- 3시 집합 돌진 유도 준비 (이후 3시, 1시, 11시, 9시에 있는 기둥들로 순차적으로 유도)",
                "- 달려드는 모션을 취할 때 부식 폭탄 사용, 발탄이 벽에 부딪힌 후 파괴 폭탄 + 파괴 스킬",
                "- 기둥 파괴 후 떨어지는 로나운의 기운을 먹어둔다. (에스더 스킬 게이지도 채워 줌)",
                "- 발탄이 하늘로 점프 시, 각자 8회 장판 회피 후, 외곽으로 이동",
                "[130줄 | 전멸기]",
                "- 피자 패턴 후, 맵 전체 전멸기 공격"
                "파훼법 1 : 기둥 파괴 시 나오는 로나운의 기운을 먹고 피자 패턴 회피",
                "파훼법 2 : 에스더 : 바훈투르 사용",
                "[120줄 | 외곽벽 파괴, 2페이즈 시작]",
                "- 해당 시점부터 카운터 패턴 등장",
                "[110줄 | 임포스터 패턴]",
                "- 컷씬 등장 후 랜덤으로 한명에게 범위 공격, 공대원 없는 곳으로 유도 후 고정되면 범위 벗어나 시정or기둥 뒤로 회피",
                "- 나머지 파티원의 경우, 기둥 뒤에서 회피",
                "- 발탄이 내려온 후 랜덤 대상 범위 공격 1회 시행, 방향유도 후 회피",
                "[85줄 | 지형 파괴]",
                "- 발탄 점프 후, 지면을 내려찍으며 한쪽 지형 외곽을 파괴",
                "- 반대쪽 외곽으로 회피",
                "- 발탄이 중앙으로 이동 후 임포스터 패턴",
                "- 범위 공격 후, 기둥 폭발"
                "[65줄 | 버러지 패턴]",
                "- 발탄 중앙 이동 후, 캐릭터 위치에 장판 -> 모여서 장판을 한 곳에 깔고 회피",
                "- 컷씬 후 발탄 전면에서 카운터",
                "[30줄 | 지형 파괴]",
                "- 85줄 지형 파괴 동일, 남아있는 외곽 파괴",
                "- 반대쪽 외곽으로 회피",
                "- 발탄이 중앙으로 이동 후 임포스터 패턴",
                "- 범위 공격 후, 기둥 폭발",
                "[15줄 | 4방향 찍기 + 연환파신권]",
                "- 발탄이 중앙으로 이동 후 4방향을 순차적으로 범위 공격",
                "- 9시에 모여 첫 공격을 9시로 유도 후, 범위 공격 회피",
                "- 이후 발탄 8번 범위 공격 (캐릭터 위치에 장판 공격)",
                "- 에스더 : 바훈투르 사용 or 시간 정지 물약 or 모여서 다 함께 장판 회피"
                "[유령 발탄]",
                "- 15줄 패턴 이후 유령 발탄 등장, 위치 중앙 고정",
                "외곽 분신의 카운터를 친 후, 발탄에게 붙어 정화 (노말 4회, 하드 6회)",
                "39줄, 26줄, 13줄 마다 잡기 패턴"
                };
                esther[] = {"130줄, 15줄 패턴 바훈투르", "실리안"};

                caution[] ={
                "[130줄 전멸기]"
                "로나운의 기운을 먹어도 첫 피자패턴 못피하면 즉사",
                "바훈투르 효과를 받는 시점에서 다운되어 있다면, 효과를 받지 못함"
                "[카운터]",
                "카운터에 성공 할 때마다 에스더 스킬 게이지 획득"
                };
                break;
            default:
                cout<<"관문 정보가 정확하지 않습니다."<<endl;
        }
    }
};
class Biackiss:public Gundanjang{
    public:
    Biackiss(int gate){
        switch(gate){
            case 1:
                named = "인큐버스 모르페";
                battle_item[] = {"회오리 폭탄", "시간 정지 물약", "신속 로브"};
                pattern[] = {
                "[55줄 | 쾌락/욕망 분리]",
                "- 각 파티별로 쾌락 or 욕망의 모르페 상대, 쾌락의 체력에 따라 패턴 진행",
                "[49줄 | 쾌락 : 구슬 넣기]",
                "- 각자 사전 조율한 자리에서 마법진에서 나온 구슬을 색에 맞춰 문에 넣기 (2싸이클 이내)",
                "- 빨-파-초-흰-검 반복 / 1, 7시 빨초 랜덤, 5,11시 파흰 랜덤",
                "[36줄 | 쾌락 전멸기 : 무력화 후 구슬 먹기]",
                "- 보스 중앙 이동 후, 무력화",
                "- 무력화 이후 본인 머리 위에 뜬 색상 확인",
                "- 1,7시 검은색 / 5, 11시 파란색, 색깔 장판 순서 기억해서 구슬 먹기",
                "- 이후 장판 안전지대 브리핑",
                "[36줄 | 욕망 전멸기 : 안전지대]",
                "- 보스 중앙 이동 후, 구슬을 들고 마법진이 생기면 쾌락 파티가 브리핑 해준 안전지대로 이동",
                "[30줄 | 반전]",
                "- 두 파티 바뀜, 6시 대기 장판 터진 후, 진행",
                "[25줄 | 안전 장판 브리핑]",
                "- 쾌락 : 12시/3시/6시/9시 중 흰 장판 위치 브리핑",
                "- 욕망 : 브리핑 듣고 흰 장판 위치로 이동",
                "[12줄 | 쾌락 전멸기 : 무력화 후 구슬 먹기]",
                "- 보스 중앙 이동 후, 무력화",
                "- 무력화 이후 본인 머리 위에 뜬 색상 확인",
                "- 1,7시 검은색 / 5, 11시 파란색, 색깔 장판 순서 기억해서 구슬 먹기",
                "- 이후 장판 안전지대 브리핑",
                "[5줄 | 광폭화]",
                "0줄까지 딜하기",
                "쾌락, 욕망 양측 파티가 모두 0줄로 만들면 클리어"
                };
                esther[] = {"니나브","무력화 패턴 웨이"};
                caution[] = {
                "- 난이도 노말의 경우, 패턴 파훼에 실패해도 시간 정지 물약을 활용하면 생존할 수 있다."
                "- 욕망의 모르페는 패턴의 안전지대를 보여주므로 패턴 회피 시, 보라색 장판 안으로 회피해야함", 
                "[난이도 - 하드 : 피자패턴]",
                "- 보스 중앙 이동 후 외곽 장판 공격, 11시/1시/5시/7시 구슬 생성", 
                "- 구슬을 밖으로 빼서 먹기, 회오리 방향 & 시작위치 본 후 모두 밟기", 
                "- 전부 밟지 못했다면 시정 or 서폿 보호막"
                };

                break;

            case 2:
                named = "욕망의 탐식자 비아키스";
                battle_item[] = {"시간 정지 물약", "진군의 깃발"};
                pattern[] = {
                "[140줄 | 욕망의 파장]",
                "- 보스 중앙 이동 후, 공중으로 이동 & 보라 구체 소환",
                "- 공대원들끼리 거리를 두고 한 방향으로 돌기 (시계방향)",
                "[120줄 | 전멸기 : 욕망의 환영 - 보접빨핀]",
                "- 사전에 날개 확인 할 자리 3명 11시/3시/7시, 구슬 먹을 십자 자리 5명 조율, 각 위치로 이동",
                "- 11시, 3시, 7시에 위치한 사람은 비아키스 환영의 날개 상태(접, 반접, 핀) 확인 후 채팅 브리핑",
                "- 십자 자리 5명은 각자 구슬 먹기",
                "- 머리 위 징표의 색깔의 개수를 확인 후, 순서에 맞게 환영 위치로 이동",
                "보라색 3개 : 접 > 반접 > 핀 순서로 이동",
                "빨간색 3개 : 핀 > 반접 > 접 순서로 이동",
                "- 필요시 진군의 깃발 사용",
                "[90줄 | 욕망의 파장]",
                "- 140줄과 동일",
                "- 보스 중앙 이동 후, 공중으로 이동 & 보라 구체 소환",
                "- 공대원들끼리 거리를 두고 한 방향으로 돌기 (시계방향)",
                "[65줄 | 전멸기 : 검빨 패턴]",
                "- 사전에 11시/5시/7시/스페어 각 2명씩 자리 조율, 각 위치로 이동",
                "- 분신이 터뜨리는 오라의 색깔 순서 확인 후 (검정 or 빨강) 브리핑",
                "- 이후 분신이 던지는 구슬 중, 검은색 순서의 구슬만 먹음",
                "- 스페어는 검은색 구슬이 3개 나오는 곳을 확인하여 해당하는 마지막 검은색 구슬을 먹어줌"
                };
                esther[] = {"니나브", "65줄 이전 웨이"};
                caution[] = {
                "[똥버리기 - 욕망의 패턴 3중첩]",
                "- 50줄 이하의 비아키스 공격에 당하면 욕망 폭발 디버프 중첩",
                "- 3중첩 시, 욕망 폭발이라는 똥 장판 생성",
                "- 3중첩 이전에 디버프를 해제하거나, 생성 시 외곽에 바깥을 바라보며 버리기",
                "[보라링]",
                "- 머리 위에 보라색 표식 (1명) 또는 빨간색 표식 (7명) 생성",
                "- 보라색 표식은 자신의 위치를 핑하며, 자신을 따라오는 보라링을 외곽에서 먹어서 제거",
                "- 빨간색 표식은 보라링의 반대편으로 이동해서 회피",
                "[기절링]",
                "- 맞으면 기절에 걸리는 노란색 작은 링들이 생김",
                "- 기절링에 맞으면 해당 위치에 장판 생성",
                "- `회피기나 시정 활용하여 주의하여 회피"
                };

                break;

            case 3:
                named = "욕망군단장 비아키스";
                battle_item[] = {"수면 폭탄", "회오리 수류탄", "시간 정지 물약"};
                pattern[] = {
                "[170줄 | 늪 패턴]",
                "- 보스 중앙 이동 후, 중앙과 외곽 원형 장판 생성",
                "- 랜덤으로 2명 절망의 늪, 나머지 신속의 욕망 표시",
                "- 절망 : 9시 방향의 앞, 뒤로 배치",
                "- 신속 : 9시 이외의 빈 곳에 배치 후, 절망의 늪 가장 외곽으로 이동",
                "[152줄 | 석상 칼 패턴]",
                "- 보스가 사라지고, 매혹 게이지에 따라 칼 또는 석상이 보임",
                "- 매혹 게이지가 70% 이상 : 칼이 보임",
                "- 매혹 게이지가 70% 이하 : 석상이 보임",
                "- 칼의 위치를 핑으로 브리핑하고, 석상과 칼의 위치가 겹치는 곳으로 회피",
                "[135줄 | 아재 패턴]",
                "- 안내 메시지와 함께 보스가 사라짐",
                "- 12시의 노란 구슬을 이용하여 매혹 게이지를 제거",
                "- 키보드 입력 패턴을 2회 반복",
                "- 성공 : 비아키스가 무력화 되고, 이후 공습 패턴",
                "- 실패 : 비아키스가 충격파를 시전한 이후 공습 패턴",
                "4회 이상 실패 : 전멸",
                "[120줄 | 왕좌 패턴]",
                "- 이끌리는 유혹 장판을 겹쳐서 깔고, 매혹 게이지를 채워 전원 매혹 걸리기 (카운터 등장 시 치지 말 것)",
                "[102줄 | 무력화 패턴",
                "- 보스 중앙 이동 후, 일정 시간 뒤 터지는 몬스터를 소환",
                "- 3시의 노란 구슬을 이용하여 매혹 게이지를 제거",
                "- 중앙의 장판이 터진 뒤, 무력화 게이지가 표시 되면 무력화 진행",
                "- 무력화 후, 소환된 몬스터가 터지기 전에 시간 정지 물약 사용",
                "[75줄 | 늪 패턴]",
                "-170줄 동일 패턴",
                "- 보스 중앙 이동 후, 중앙과 외곽 원형 장판 생성",
                "- 랜덤으로 2명 절망의 늪, 나머지 신속의 욕망 표시",
                "- 절망 : 9시 방향의 앞, 뒤로 배치",
                "- 신속 : 9시 이외의 빈 곳에 배치 후, 절망의 늪 가장 외곽으로 이동",
                "[55줄 | 촉수 패턴]",
                "- 12시를 제외한 방향에 촉수 등장",
                "- 매혹 게이지가 70% 이상인 상태에서만 데미지가 들어감",
                "- 중앙에서 나오는 붉은 구슬을 맞아가며 게이지를 조절, 촉수를 파괴",
                "[40줄 | 구슬 막기 (난이도 하드)]",
                "- 보스가 중앙으로 이동하며 안, 밖 순서대로 장판 공격",
                "- 4방향에 구슬 생성 (1시/5시/7시/11시)",
                "- 구슬을 먹어 비아키스에게 들어가는 것을 막고 스페이스바 연타",
                "[0줄 | 발악 패턴]",
                "- 컷씬 후, 12시/3시/6시/9시에 분신 생성",
                "- 미니맵 확인 후 중앙에서 생성되는 검은 장판을 밟으며 보스 뒤로 이동&무력화",
                "- 공습 패턴 후, 보스 중앙 이동",
                "- 매혹 장판 외곽에 설치 및, 장판 공격 회피",
                "- 이후 반복",
                "- 보스 체력바 아래 무력 게이지를 0으로 만드면 클리어"
                };
                esther[] = {"102줄 무력화 패턴 이전 니나브", "0줄 발악 패턴 웨이"};
                caution[] = {
                "[매혹 게이지]",
                "- 매혹 게이지가 0이면 보스에게 딜이 제대로 들어가지 않음",
                "- 보스의 패턴에 맞을 때 마다 게이지 상승",
                "- 게이지가 100%가 되면 매혹 상태에 빠지게 됨 (매혹에 걸리게 되면 공대원을 자동으로 공격)",
                "- 매혹 걸린 사람에게 기절 스킬 또는 수면 폭탄을 사용",
                "[메두사 패턴]",
                "- 기본적으로 1파티가 담당, 2파티가 스페어",
                "- 보스 머리 위에 눈 모양과 바닥에 검은 연기가 생김",
                "- 잠시 후 보스를 보고 있는 대상은 석화에 걸리고, 파훼에 실패 시 즉사급 데미지가 들어옴",
                "- 데미지가 들어오기 전 시간 정지 물약 사용시, 생존 가능",
                "[파훼법:노말]",
                "- 전부 보스로부터 뒤돌아서 쳐다보지 않기",
                "[페훼법:하드]",
                "- 비아키스의 날개의 상태에 따라 파훼 (다접, 반접, 다핌)"
                "- 날개를 다 접음 : 모두 뒤돌기",
                "- 날개를 반만 접음 : 한 명만 비아키스 쳐다보기 (대처하는 두 명 중 파티 번호가 빠른 사람)",
                "- 날개를 다 핌 : 두 명만 비아키스 쳐다보기",
                "- 첫 번째 시전 시 1파티의 파티 번호 1, 2번이 메두사에 대처",
                "- 두 번째 시전 시 1파티의 파티 번호 3, 4번이 메두사에 대처",
                "[고래 패턴]",
                "- 바닥에 육망성 그림이 등장하며 매혹 게이지가 70% 이상일 경우에만 보이는 몬스터 등장",
                "- 매혹 게이지가 70% 이상인 사람이 안전한 위치를 핑하며 회피",
                "- 12시와 6시 방향 외곽 끝부분에 있어도 안전",
                "[120줄 왕좌 패턴]",
                "- 패턴이 끝난 이후에도 장판이 남아 다시 매혹에 걸리는 경우가 있으니 주의"
                };
                break;

            default:
                cout<<"관문 정보가 정확하지 않습니다."<<endl;
        }
    }
};
class Kouku_Saton:public Gundanjang{
    public:
    Kouku_Saton(int gate){
        switch(gate){
            case 1:
                named = "화려한 서커스 - 세이튼";
                battle_item[] = {"회오리 수류탄, 성스러운 부적, 시간 정지 물약"};
                pattern[] = {
                "[128줄 | 반격 무력화]",
                "- 세이튼 앞, 뒤에 보라색 방패가 1개 또는 2개 생성",
                "- 보라색 방패 방향에서 공격 시, 반격 데미지가 들어오므로 방패가 있는 방향을 피해서 무력화",
                "[100줄 | 세이튼 찾기]",
                "- 안내 문구와 함께 세이튼이 사라지며, 1시/5시/7시/11시에 분신 등장",
                "- 사전에 조율한 위치로 가서 세이튼의 분신의 행동을 확인",
                "- 분신은 하트 또는 총을 쏘는데, 이때 하트인 위치에 핑",
                "- 혼자만 다른 행동을 취하는 분신 방향을 바라보기",
                "[88줄 | 땐쓰 타임]",
                "- 광대로 변신하며 본인 문양에 맞는 장판에 위치",
                "- 세이튼의 동작을 살피고 같은 동작 따라하기",
                "- 세이튼이 뒤돌면, 다른 동작 하기",
                "[60줄 | 반격 무력화]",
                "- 128줄 동일 패턴",
                "- 세이튼 앞, 뒤에 보라색 방패가 1개 또는 2개 생성",
                "- 보라색 방패 방향에서 공격 시, 반격 데미지가 들어오므로 방패가 있는 방향을 피해서 무력화",
                "[48줄 | 룰렛]",
                "- 세이튼이 중앙으로 이동하며 룰렛을 돌림",
                "- 본인 머리 위의 트럼프 카드 색상, 문양 확인 후 같은 장판에 위치",
                "- 3번 반복 후 룰렛 밖으로 회피",
                "[22줄 | 세이튼 찾기]",
                "-100줄 동일 패턴",
                "- 안내 문구와 함께 세이튼이 사라지며, 1시/5시/7시/11시에 분신 등장",
                "- 사전에 조율한 위치로 가서 세이튼의 분신의 행동을 확인",
                "- 분신은 하트 또는 총을 쏘는데, 이때 하트인 위치에 핑",
                "- 혼자만 다른 행동을 취하는 분신 방향을 바라보기"
                };
                esther[] = {"니나브", "반격 무력화 패턴 웨이"};
                caution[] = {
                "[광기 게이지 (전 관문 동일)]",
                "- 보스 패턴에 맞을 때마다, 광기 게이지 상승"
                "- 광기 게이지가 100% 도달 시, 광대로 변신",
                "- 광대로 변신할 때마다, 보스에게 데미지 감소 버프 중첩 +1",
                "[주사위 감금 패턴]",
                "- 세이튼이 주사위를 던진 후 감금, 4개의 카드를 던짐",
                "- 주사위 대상자만 감금 / 주사위 대상을 제외한 3명 감금",
                "- 같은 문양의 카드를 먹어야 데미지가 안들어옴",
                "- 1인 감금 시 공대원들이 본인 문양에 맞는 카드를 먹어주기",
                "- 3인 감금 시 공대원들이 본인 문양에 맞는 카드를 먹을 수 있도록 유도하기"
                };
                
                break;

            case 2:
                named = "세이튼의 책 - 쿠크";
                battle_item[] = {"성스러운 부적", "시간 정지 물약"};
                pattern[] = {
                "[125줄 | 거대 세이튼 등장]",
                "- 쿠크가 이동하며, 거대 세이튼이 등장",
                "- 폭탄or공 튀기기 공격을 회피",
                "[110줄 | 광기의 장막]",
                "- 파티 번호 기준 1,2번 왼쪽, 3,4번 오른쪽",
                "- 빨간 장판의 경우 2명이 함께, 파란 장판의 경우 1명씩 각자 위치",
                "[95줄 | 쿠크 찾기]",
                "- 쿠크가 사라진 후 카드 뒷면 등장",
                "- 세이튼이 망치로 대상자에게 망치 공격, 공격이 카드에 닿으면 카드 앞면이 잠깐 보임",
                "- 좌우>중앙 순으로 망치 공격을 유도하며 쿠크의 위치를 파악",
                "- 세이튼의 망치 공격이 쿠크에게 닿으면 패턴 파훼",
                "[88줄 | 카드 미로]",
                "- 1명이 가운데 통을 부수면 시야가 맵 전체를 볼 수 있게 됨",
                "- 1명은 문양 병정의 위치를 브리핑",
                "- 나머지 3명은 주기적으로 등장하는 세토를 회피하며 본인 문양에 맞는 병정 3회 잡기 > 완성된 문양 얻기",
                "- 완성된 문양을 얻은 상태로 3명 모두 각 출구에 도달하면 미로 파훼",
                "[55줄 | 피자 패턴]",
                "- 쿠크가 중앙으로 이동, 쿠크 주변 별의 방향 확인 (총 3회)",
                "- 12시부터 출발하며 확인 했던 별 방향으로 회피하며 피자 패턴 파훼",
                "[25줄 | 쿠크 찾기]",
                "- 95줄 동일 패턴",
                "- 쿠크가 사라진 후 카드 뒷면 등장",
                "- 세이튼이 망치로 대상자에게 망치 공격, 공격이 카드에 닿으면 카드 앞면이 잠깐 보임",
                "- 좌우>중앙 순으로 망치 공격을 유도하며 쿠크의 위치를 파악",
                "- 세이튼의 망치 공격이 쿠크에게 닿으면 패턴 파훼",
                };
                esther[] = {"니나브", "55줄 패턴 이난나"};
                caution[] = {
                "거대 세이튼의 공격에 피격 시 낙사 조심"
                "[빨강/하양 장판]"
                "- 하얀 장판 : 광기 게이지 제거"
                "- 빨강 장판은 광기 게이지를 증가시키니 못 들어갈 것 같으면 외곽으로 회피"
                };
                
                break;

            case 3:
                named = "한밤중의 서커스 - 쿠크세이튼";
                battle_item[] = {"회오리or암흑 수류탄", "신속 로브", "시간 정지 물약"};
                pattern[] = {
                "[155줄 | 1칼날 처형식 + 무력화]",
                "- 마리오 입장 순서 사전에 조율",
                "- 마법진이 생기면 광기 게이지를 채워 광대로 변신 후, 1마리오 진행",
                "- 막이 내리며 랜덤 대상 감금, 톱날을 피해 쿠크세이튼에게 접근하여 무력화 진행",
                "[125줄 | 2칼날 처형식 + 무력화]",
                "- 마법진이 생기면 광기 게이지를 채워 광대로 변신 후, 2마리오 진행",
                "- 막이 내리며 랜덤 대상 감금, 갈고리를 피해 쿠크세이튼에게 접근하여 무력화 진행",
                "[90줄 | 렛츠 쇼타임]",
                "- 쿠크세이튼이 중앙으로 이동하며 컷씬 등장",
                "- 랜덤 대상 2명에게 표식, 외부로 유도하기",
                "- 어글자 1회 공격 후, 랜덤 방향 난사",
                "- 외곽 장판 4번 터진 후, 방향 전환 및 폭탄 투척",
                "- 쿠크세이튼의 공격을 폭탄 방향으로 유도하여 폭탄 처리 (두 번째 폭탄 반대편에 생성)",
                "- 폭탄 처리 1회 반복",
                "- 각 대상을 쫓아오는 표적과 함께 무작위 공습 패턴 (시계 방향으로 돌며 회피)",
                "[80줄 | 3칼날 처형식 + 무력화]",
                "- 마법진이 생기면 광기 게이지를 채워 광대로 변신 후, 3마리오 진행",
                "- 막이 내리며 랜덤 대상 감금, 갈고리와 톱날을 피해 쿠크세이튼에게 접근하여 무력화 진행",
                "[55줄 | 4칼날 처형식 + 무력화]",
                "- 마법진이 생기면 광기 게이지를 채워 광대로 변신 후, 4마리오 진행",
                "- 막이 내리며 랜덤 대상 감금, 갈고리를 피해 쿠크세이튼 위아래의 레버에 각각 접근",
                "- 키보드 입력 패턴 수행 후, 레버 당기고 쿠크세이튼 무력화 진행",
                "[0줄 | 앵콜 (오셀로 빙고)]",
                "- 5X5 빙고판에서 플레이",
                "- 랜덤 대상에게 표적 생성 후, 잠시 후 대상의 위치에 폭탄 생성",
                "- 폭탄은 십자로 터지며, 바닥을 뒤집음 (빙고된 칸은 뒤집히지 않음)",
                "- 3번째 폭탄마다 쿠크세이튼이 12시 방향으로 이동하며 딜타임"
                "- 이때 빙고를 완성시키지 못하면 전멸"
                "- 빙고를 반복하며 쿠크세이튼의 체력을 0줄로 만들면 클리어"
                };
                esther[] = {"니나브", "90줄 쇼타임 패턴, 오셀로 빙고 실패 시 이난나", "칼날 처형식 무력화 웨이"};
                caution[] = {
                "[마리오]",
                "- 본인의 마리오 입장 순서 전 쿠크세이튼의 패턴들을 이용해 광기 게이지를 조절",
                "- 마법진과 함께 등장하는 인형이 내뿜는 불을 이용하여 광대로 변신, 마법진 중앙을 통해 마리오 입장",
                "- 중앙에 있을 시, 강력한 데미지를 입으므로, 마리오 입장자가 아니면 중앙에 가지 말 것",
                "- 마리오에 입장한 사람은 파티원의 브리핑이나, 디버프칸을 확인하여 해제해야할 저주의 색상 확인",
                "- 마리오를 진행하며, 저주의 색상과 같은 공 3개를 부숴 저주를 해제하고 나오면 된다"
                };

                break;

            default:
                cout<<"관문 정보가 정확하지 않습니다."<<endl;
        }
    }

};
class Abrelshud_Nomal:public Gundanjang{
    public:
    Abrelshud_Nomal(int gate){
        switch(gate){
            case 1:
                named = "게헤나 헬카서스";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;
            
            case 2:
                named = "프로켈의 사념체 / 몽환의 기사 프로켈";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;

            case 3:
                named = "아슈타로테";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]                
                
                break;

            case 4:
                named = "태초의 악몽";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;

            case 5:
                named = "악몽의 지배자 아브렐슈드";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;

            case 6:
                named = "몽환군단장 아브렐슈드";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;

            default:
                cout<<"관문 정보가 정확하지 않습니다."<<endl;
        }
    }
};
class Abrelshud_Hard:public Gundanjang{
    Abrelshud_Hard(int gate){
        switch(gate){
            case 1:
                named = "게헤나 헬카서스";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;
            
            case 2:
                named = "프로켈의 사념체 / 몽환의 기사 프로켈";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;

            case 3:
                named = "아슈타로테";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]                
                
                break;

            case 4:
                named = "태초의 악몽";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;

            case 5:
                named = "악몽의 지배자 아브렐슈드";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;

            case 6:
                named = "몽환군단장 아브렐슈드";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;

            default:
                cout<<"관문 정보가 정확하지 않습니다."<<endl;
        }
    }
};
class Illiakan_Nomal:public Gundanjang{
    Illiakan_Nomal(int gate){
        switch(gate){
            case 1:
                named = "비통의 지배자 마우르그";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;
            
            case 2:
                named = "쇠락의 군주 일리아칸";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;

            case 3:
                named = "질병군단장 일리아칸칸";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;

            default:
                cout<<"관문 정보가 정확하지 않습니다."<<endl;
        }
    }
};
class Illiakan_Hard:public Gundanjang{
    Illiakan_Hard(int gate){
        switch(gate){
            case 1:
                named = "비통의 지배자 마우르그";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;
            
            case 2:
                named = "쇠락의 군주 일리아칸";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;

            case 3:
                named = "질병군단장 일리아칸칸";
                battle_item[]
                hp[]
                pattern[]
                esther[]
                caution[]

                break;

            default:
                cout<<"관문 정보가 정확하지 않습니다."<<endl;
        }
    }
};
class Gundanjang{
    protected:
    string pattern; //보스 체력 및 패턴
    string battle_item; //배틀 아이템
    string named; //보스 이름
    string esther; //사용 에스더
    string caution; //주의 사항
};